# 5. Английский словарь
# "Пора учить английский язык", - сказал себе Степа и решил написать программу для изучения английского языка. 
# Программа получает на вход слово на английском языке и несколько его переводов на русском языке. 
# Составьте словарь, в котором ключ - это английское слово, а значение - это список русских слов. 
# В этой задаче нужно использовать строчный метод split().

amount_words = int(input('Введите количество слов: '))
dict = {}

for i in range(amount_words):
    english_word = input('Введите слово на английском: ')
    russian_word = input('Введите перевод: ').split(',')
    dict.setdefault(english_word, russian_word)

print(dict)

